Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: The development of digital skills in the subject of Social science involves learning to use digital tools and digital media to acquire knowledge in the subject and demonstrate one’s competence and one’s ability to improve knowledge in the field.
nb: Utvikling av digitale ferdigheter i samfunnsfag innebærer å lære seg å bruke digitale verktøy og medier for å tilegne seg faglig kunnskap, uttrykke egen kompetanse og forsterke faglige budskap.

source: give an account of the prevalence of the Sami languages and of Sami language rights in Norway
nb: gjøre rede for grunnleggende prinsipper for personvern og opphavsrett knyttet til publisering og bruk av andres tekster

source: in Basic Norwegian for language minorities involves reading Norwegian texts and perfecting one’s reading skills.
nb: i grunnleggende norsk for språklige minoriteter innebærer å lese norske tekster og videreutvikle sine leseferdigheter.

source: express themselves using a varied vocabulary and master morphology, orthography and cohesion
nb: uttrykke seg med et variert ordforråd og mestre formverk, ortografi og tekstbinding

source: explain how certain types of engines are constructed, work and perform
nb: forklare oppbygning av, virkemåte og ytelse til relevante motortyper

source: in Geosciences involves describing experiences, observations and gathering information by using the concepts and terminology from geosciences.
nb: i geofag innebærer å beskrive opplevelser, observasjoner og innsamlet informasjon ved å bruke geofaglige begreper.

source: use digital writing tools in writing processes and in production of interactive texts
nb: bruke ord og begreper for vær og føre, og fortelle om merkedager og værtegn

source: describe properties and minimum definitions of two and three
nb: beskrive egenskaper ved og minimumsdefinisjoner av to- og

source: ‘They need a supportive grown-up to be there for them.
nb: De trenger en nær og støttende voksen.

source: discuss the concepts economic growth, standard of living, quality of life and sustainable development and the relationship between these
nb: diskutere begrepene økonomisk vekst, levestandard, livskvalitet og bærekraftig utvikling og forholdet mellom dem

source: The health services and school owner must work together to determine who is to inform the various
nb: Helsetjenesten og skoleeier må samarbeide om hvem som skal informere de ulike gruppene (elever,

source: Based on their own life experiences, the pupils shall gain an understanding of who they are, and how they can master their own lives.
nb: Religion og etikk skal gi elevene kunnskap om religioner, livssyn og etikk og bidra til forståelse av kulturelt mangfold og identitet.

source: In autumn 2008, the English authorities introduced a new
nb: Hausten 2008 innførte engelske styresmakter en ny nasjonal

source: It includes oral and written texts, but also composite texts that include non-verbal forms of expression, such as images, music and graphics.
nb: Det omfatter muntlige og skriftlige verbaltekster, men også sammensatte tekster som inkluderer ikke-verbale uttrykksformer som bilde, musikk og grafikk.

source: ‘When Lucas climbs onto the roof, there is a shift in the relationship between the adult and the child.
nb: Når Lucas klatrer opp på taket, blir forholdet mellom den voksne og barnet annerledes.

source: When the children are promoted from the toddlers’ section to the next section in August, they are given two pine cones.
nb: Når barna flytter fra avdelingen for de yngste og over på neste avdeling i august hvert år, får de to kongler.

source: develop and use well-reasoned strategies to perform calculations using
nb: utvikle og bruke hensiktsmessige strategier i regning med brøk,

source: “The county of Aust-Agder had initiated a pilot project with early effort in two municipalities.
nb: – Aust-Agder fylke satte i gang et forsøksprosjekt med tidlig innsats i to kommuner.

source: The pupils also demonstrate and develop competence by exploring mathematical concepts, using mathematical methods and reasoning mathematically.
nb: Elevene viser og utvikler også kompetanse når de samtaler om og gir og får tilbakemeldinger på ulike dramatiske og rytmiske uttrykk.

source: The principles of equivalent education shall be the basis for teaching in the subject.
nb: Det innebærer at alle religioner og livssyn skal behandles på en faglig og sakssvarende måte ut fra sitt særpreg.

source: ‘In the context of preschool, care is both something physical and something interpersonal’, comments Hultman.
nb: – Omsorg er både noe kroppslig og noe mellommenneskelig i barnehagens kontekst, mener Löfdahl Hultman.

source: The laws and theories of natural science are models of a complex reality, and these models are changed or developed through new observations, experiments and ideas.
nb: Naturvitenskapens lover og teorier er modeller av en sammensatt virkelighet, og disse modellene endres eller videreutvikles gjennom nye observasjoner, eksperimenter og ideer.

source: analyse the causes of the abuse of children and adolescents, and elaborate on and discuss how such abuse can be prevented
nb: analysere årsaker til mishandling av barn og unge og drøfte hvordan mishandling kan hindres

source: The pupils demonstrate and develop competence in the subject when they use knowledge about nature and society to explore and reflect on different geographic conditions.
nb: Elevene viser og utvikler kompetanse i geografi når de bruker kunnskap om natur og samfunn til å utforske og reflektere over ulike geografiske forhold.

source: recognise and use mirror symmetry in practical situations
nb: gjenkjenne, bruke og samtale om speilsymmetri i praktiske situasjoner

source: Lina points to the bird’s beak and says: ‘
nb: Lina peker på fuglens nebb og sier:

source: But the nicest thing about working here is the fact that we are so many teachers, more than 50 percent.
nb: Men det som først og fremst er positivt med å jobbe her, er at vi er så mange barnehagelærere, over 50 prosent.

source: Researcher Ann-Sofi Larsen participated in departmental meetings in three different kindergartens.
nb: Forsker Ann-Sofi Larsen har deltatt på avdelingsmøter i tre ulike barnehager.

source: choose and use different listening and speaking strategies that are suitable for the purpose
nb: gjøre rede for likheter og forskjeller mellom de nordiske språkene og mellom norrønt og moderne norsk språk

source: In it, they asked what employees believed to be included in the teaching of technology in ECEC institutions.
nb: Her spurte de hva de ansatte mente teknologiundervisning i barnehagen var.

source: discuss the form, content and purpose of literature, theatre and films and present interpretative readings and dramatisations
nb: samtale om form, innhold og formål i litteratur, teater og film og fremføre tolkende opplesing og dramatisering

source: explain what cooperation, participation and democracy mean on a national, local, organizational and educational scale
nb: gi eksempler på hva samarbeid, medvirkning, demokrati og deltakelse betyr nasjonalt, lokalt, i organisasjoner og i skolen

source: listen to, evaluate and provide constructive feedback on oral presentations given by others
nb: beskrive egenarten av kvensk språk og identifisere likheter og ulikheter mellom kvensk og finsk

source: Aquaculture - curriculum for common programme subject in VG2 (AKV2-02)
nb: Programområde for akvakultur - Læreplan i felles programfag Vg2 (AKV2-02)

source: It involves the use of mathematical symbols and formal mathematical language to solve problems and present solutions.
nb: Det innebærer å bruke matematiske symboler og det formelle matematiske språket til å løse problemer og presentere løsninger.

source: This also involves the varied use of words and expressions, concepts, linguistic patterns and creation of text.
nb: Det innebærer også variert bruk av ord og uttrykk, begreper, språklige mønstre og tekstskaping.

source: They also demonstrate and develop competence when they argue for the choice of methods, undertake ethical and safety assessments, reflect on findings and critically assess sources and information relating to their explorations and experiments.
nb: De viser og utvikler også kompetanse når de argumenterer for metodevalg, gjør etiske og sikkerhetsmessige vurderinger, reflekterer over funn og kritisk vurderer kilder og informasjon knyttet til egne utforskinger og forsøk.

source: create, communicate and converse about own texts inspired by English literature, films and cultural forms of expression
nb: gi eksempler på språklige særtrekk i eget miljø og sammenlikne med andre sentrale dialekter og sosiolekter på norsk og tegnspråk

source: In this way, they can communicate what they want, without having language.
nb: Slik forteller de hva de vil, uten å ha språk.

source: describe and assess his/her own work in learning English
nb: beskrive og vurdere eget arbeid med å lære engelsk

source: talk about Buddhism, the Buddhist manner of viewing life and ethics with an emphasis on Buddha, their view of existence, of viewing humanity, the Teachings, the social order, current ethical challenges and selected texts
nb: samtale om buddhisme, buddhistisk livstolkning og etikk med vekt på Buddha, synet på tilværelsen, menneskesyn, læren, ordenssamfunnet, utvalgte tekster og aktuelle etiske utfordringer

source: In the natural science subject, written reports from experiments, fieldwork, excursions and technological development processes are an important part of the work.
nb: I naturfag er skriftlige rapporter fra eksperimenter, feltarbeid, ekskursjoner og fra teknologiske utviklingsprosesser sentrale.

source: select and describe some global conflicts of interest and assess the consequences these might have for the local population and the global community
nb: velge ut og beskrive noen globale interessekonflikter og vurdere hvilke følger disse konfliktene kan få for lokalbefolkning og for verdenssamfunnet

source: explore and use well-reasoned central tendency measures in one’s own
nb: utforske og bruke hensiktsmessige sentralmål i egne og andres

source: It is the responsibility of the employer to facilitate this.
nb: når smitten øker i samfunnet, øker også smitten hos barn og unge.

source: The subject shall encourage a higher quality in workshop services and help promote the safe and rational use of industrial machines.
nb: Faget skal fremme økt kvalitet i verkstedtjenestene og bidra til sikker og rasjonell bruk av arbeidsmaskiner.

source: Do we need entrepreneurial learning in kindergarten?
nb: Trenger vi entreprenøriell læring i barnehagen?

source: It focuses on indigenous peoples, ethnic and national minorities and how xenophobia and racism can be countered.
nb: Det handler om urfolk, etniske og nasjonale minoriteter, utfordringer i og muligheter for utvikling av flerkulturelle samfunn og hvordan fremmedfrykt og rasisme kan motarbeides.

source: Marketing and management 2 builds on Marketing and management 1.
nb: Markedsføring og ledelse 2 bygger på markedsføring og ledelse 1.

source: They use the calculator frequently; 80% report that they have used a graphing calculator or symbolic calculator when they were working with items in TIMSS Advanced.
nb: 80 % av dem rapporterer at de har brukt en grafisk kalkulator eller grafisk kalkulator med symbolbehandlingsmuligheter når de arbeidet med oppgavene i TIMSS Advanced.

source: They do head counts before and after leaving and arriving.
nb: De teller hverandre før og etter avgang og ankomst.

source: use tools, analogue and digital instruments and equipment for trouble-shooting, maintenance and repairs
nb: bruke håndverktøy, analoge og digitale instrumenter og utstyr for feilsøking, vedlikehold og reparasjoner

source: It involves being able to discuss, elaborate and substantiate choices, solutions and suggestions.
nb: Det innebærer å kunne drøfte og begrunne valg av løsninger og anbefalinger.

source: present an overview of the diversity of Judaism, important historic events and Judaism's position in Norway and the world today
nb: gi en oversikt over viktige historiske hendelser og innhente informasjon om jødedommens stilling i Norge og verden i dag

source: 2011 marked the advent of a new curriculum for ECEC institutions in Sweden.
nb: I 2011 kom det en ny læreplan for barnehagene i Sverige.

source: express oneself to obtain help in understanding and being understood in different situations
nb: uttrykke seg skriftlig med presisjon og sammenheng og benytte et variert og nyansert ordforråd og ulike setningskonstruksjoner i eget skrivearbeid

source: This was a common method used in the kindergartens the researchers visited.
nb: Dette var en vanlig arbeidsmåte i de barnehagene forskerne besøkte.

source: give an account of theories concerning the choice of spouse; analyse the causes of marital problems, and elaborate on and discuss how problems can be prevented and resolved
nb: gjøre rede for teorier om valg av samlivspartner, analysere årsaker til samlivsproblemer og drøfte hvordan problemene kan forebygges og løses

source: Whereupon Johan chimes in loudly:
nb: Hvorpå Johan sier høyt:

source: using Norwegian or Sign Language, discuss and reflect on their own language and code switching
nb: samtale om og reflektere over, på norsk eller tegnspråk, sin egen språk- og kodeveksling

source: use a variety of notes as a basis for their own writing
nb: skrive beskjeder og beskrivende, fortellende og spørrende setninger

source: Communication also involves precise and coherent expression in a number of oral and written genres, including composite texts.
nb: Kommunikasjon omfatter også presis og sammenhengende framstilling i en rekke skriftlige og muntlige sjangrer, inkludert sammensatte tekster.

source: the national cases about cross-sectoral collaboration of services for the target group?
nb: Kommunen skal gi tilskudd til driftskostnader i godkjente ikke-kommunale barnehager.

source: Furthermore, the ability to summarise, compare and interpret statistical information will be developed along with the ability to analyse and assess data and use it critically.
nb: Videre utvikles evnen til å sammenfatte, sammenligne og tolke statistisk informasjon, og evnen til analyse, kritisk bruk og vurdering av data.

source: Malin protests by standing up and shouting ‘No!’ when they call her a dummy.
nb: Malin protesterer ved å stå opp og rope «Nei!» når de kaller henne dum.

source: Democracy and citizenship
nb: Demokrati og medborgerskap

source: The pupil must also communicate and evaluate the validity of his or her solutions.
nb: Eleven må også kommunisere og vurdere gyldigheten av løsningene.

source: accurately convey technical information using digital media and tools
nb: formidle faginnhold presist ved å bruke digitale medier og verktøy

source: In addition, it deals with possible environmental impacts from the production, use and controlled dumping of different materials.
nb: Videre dreier det seg om mulige miljøkonsekvenser ved produksjon og deponering av ulike materialer.

source: select and use content from different sources independently, critically and responsibly
nb: velge og bruke innhold fra ulike kilder på en selvstendig, kritisk og ansvarlig måte

source: Some said that it is difficult when they don’t know anything about what has taken place at the child’s home.
nb: Noen fortalte at det var vanskelig når de ikke visste noe om hva som skjedde hjemme hos barnet.

source: Some managers reported bans on riding tricycles downhill.
nb: Noen styrere rapporterte om forbud mot å sykle på trehjulssykkel i nedoverbakker.

source: discuss and present subject-related topics using specialist terminology and coherent arguments
nb: drøfte og presentere norskfaglige emner ved hjelp av fagterminologi og helhetlig argumentasjon

source: perform, describe and provide rationale for geometric constructions using a compass and ruler and dynamic geometry programs
nb: utføre, beskrive og begrunne geometriske konstruksjoner med passer og linjal og dynamisk geometriprogram

source: “When two children are arguing, two ask about something and another is wandering too far away, it can be difficult to remain a sensitive grown-up.
nb: – Når to barn krangler, to spør om noe og ett barn er på vei for langt bort, da er det vanskelig å være en sensitiv voksen.

source: Most of them are harmless, and some are even useful, but some are pathogens.
nb: De fleste er uskadelige, noen er også nyttige, og noen er sykdomsfremkallende.

source: To use means to apply something or to carry out a task to reach a goal.
nb: Å presentere er å vise, forklare og legge frem et faglig emne eller et produkt.

source: find information in texts or in practical situations, choose an arithmetic operation and provide rationale for the choice, assess the results and present and discuss the chosen solutions
nb: finne informasjon i tekster eller praktiske sammenhenger, stille opp og forklare beregninger og framgangsmåter, vurdere resultatet og presentere og diskutere løsningen

source: Technology and design The main subject area
nb: Teknologi og design Emnet

source: it should be documented, and
nb: det skal dokumenteres,

source: It is easy to understand why when you step through the front door of the 800 square metre kindergarten.
nb: Og du forstår hvorfor når du kommer inn i den 800 kvadratmeter store barnehagen.

source: Little virus was found on the tables and chairs in the kindergartens.
nb: Det var heller ikke mange virus å finne på bord og stoler i barnehagene.

source: examine one or more international conflicts after 1945, and assess these based on different perspectives
nb: undersøke en eller flere internasjonale konflikter etter 1945, og vurdere konfliktene, sett fra ulike perspektiver

source: Others stated that they felt a conflict of loyalties between the two parents.
nb: Andre fortalte at de kom i en lojalitetskonflikt mellom de to foreldrene.

source: in Machines involves understanding and following work specifications, procedures, repair manuals and standards.
nb: e i programområde for arbeidsmaskiner innebærer å forstå og følge arbeidsbeskrivelser, prosedyrer, reparasjonshåndbøker og standarder.

source: examine two or more international conflicts after 1945, and assess these based on different perspectives
nb: undersøke to eller flere internasjonale konflikter etter 1945, og vurdere konfliktene, sett fra ulike perspektiver

source: listen to and evaluate argumentation in texts created by others and form an opinion on their content and purpose
nb: lytte til og vurdere argumentasjonen i andres tekster og ta stilling til innhold og formål

source: This means discussing, sharing and conveying information in their writing with the help of digital tools.
nb: Elevene viser og utvikler kompetanse i faget når de øver på, utøver og formidler musikk alene og sammen med andre.

source: exploit and assess various situations, working methods and strategies for learning English
nb: utnytte og vurdere ulike situasjoner, arbeidsmåter og strategier for å lære seg engelsk

source: The programme subject Politics, the individual and society is an educative subject designed to stimulate involvement and democratic participation through social and value-related issues.
nb: Programfaget politikk, individ og samfunn er et allmenndannende fag som skal stimulere til engasjement og demokratisk deltakelse gjennom arbeid med verdi- og samfunnsspørsmål.

source: carry out experiments with chemical reactions and explain what characterises these reactions
nb: gjennomføre forsøk med kjemiske reaksjoner og forklare hva som kjennetegner disse reaksjonene

source: Formative assessment shall help to promote learning and develop competence in the mathematics subject.
nb: Underveisvurderingen skal bidra til å fremme læring og til å utvikle kompetanse i matematikk.

source: We may also reflect on a subject, practical activities or our own learning.
nb: Å beskrive er å skildre eller gjengi en opplevelse, situasjon, arbeidsprosess eller et faglig emne.

source: The programme subject deals with the use of freshwater and seawater for growing fish, algae and animals in different stages of life, annual cycles and environments.
nb: Programfaget handler om bruk av ferskvann og sjøvann til oppdrett av fisk, alger og dyr i ulike livsstadier, årssykluser og miljøer.

source: compare the ideological bases of Liberalism and Marxism
nb: sammenlikne liberalismen og marxismen og drøfte deres syn på frihet og likhet

source: The curriculum is level-oriented and not related to age and applies to pupils of different ages and with different experience backgrounds.
nb: Læreplanen er nivåbasert, aldersuavhengig og gjelder for elever med ulik alder og erfaringsbakgrunn.

source: ‘I see your children are up on the roof of the playhouse.
nb: «Jeg ser dine barn er oppe på lekehustaket.

source: in Mathematics for the natural sciences involves using digital tools for comprehensive computations and visualisation.
nb: i matematikk for realfag innebærer å bruke digitale verktøy til omfattende beregninger og visualisering.

source: recognise some regional accents from English-speaking countries
nb: gjenkjenne noen regionale aksenter fra engelskspråklige land

source: Who is the target group?
nb: Og hvem er målgruppen?

source: Technology, science and society
nb: Teknologi, naturvitenskap og samfunn

source: The teacher shall facilitate for pupil participation and stimulate their desire to learn by facilitating for varied, practical and exploratory ways of working.
nb: Læreren skal legge til rette for elevmedvirkning og stimulere til lærelyst gjennom å legge til rette for varierte, praktiske og utforskende arbeidsmåter.

source: The rule is that the children are to sit on benches during these shared circle time activities.
nb: Regelen er at barna skal sitte på benker i disse samlingsstundene.

source: Her conclusion is that gender should once again be addressed as a topic in kindergarten.
nb: Konklusjonen hennes er at kjønn på nytt bør bli et tema i barnehagen.

source: They also demonstrate and develop their competence in mathematics when they reason about and argue for solutions and mathematical relationships.
nb: Videre viser og utvikler de kompetanse i matematikk når de resonnerer over og argumenterer for løsninger og matematiske sammenhenger.

source: The development of writing related to mathematics begins with simple forms of expression and gradually moves toward more formal symbolic language and a precise terminology.
nb: Utviklingen i å skrive i matematikk går fra å bruke enkle uttrykksformer til gradvis å ta i bruk et formelt symbolspråk og en presis fagterminologi.

source: These skills are crucial to democracy, the rule of law and science, and to an active participation in the Information Society.
nb: Dette er viktige ferdigheter for demokrati, rettsstat og vitenskap, og for aktiv deltakelse i informasjonssamfunnet.

source: carry out work on new installations with a view to finance and use of resources, and in line with relevant regulations and standards
nb: utføre arbeid i nyanlegg med tanke påøkonomi og ressursutnyttelse og i tråd med gjeldende regelverk og standarder

source: take on different roles in drama activities, recitations and presentations in Norwegian or Sign Language
nb: Opplæringen kan gi nye perspektiver på ulike tenkemåter og kommunikasjonsmønstre, og på egen og andres levemåte og livssituasjon.

source: When very strict social contact restrictions are
nb: Når den voksne befolkningen i stor grad har
